import CategoryAccordion from "../ui/CategoryAccordion";

const data = [
  {
    id: "cat-1",
    name: "تدرب بلا حدود",
    items: [
      { id: "q1", title: "ما هو اشتراك تدرب بلا حدود؟", content: "تعلم مع أكثر من 1000 دورة تدريبية في مختلف المجالات ناطقة باللغة العربية، لك باشتراك واحد فقط، شاهدها الآن عبر تدرب بلا حدود وأحصل على شهادة إتمام للدورة التدريبية فور الانتهاء منها، مئات من الشهادات التعليمية بانتظارك. شاهد جميع الدورات المضافة حديثًا دون مصاريف إضافية. تعلم مع أكثر من 1000 دورة تدريبية في مختلف المجالات ناطقة باللغة العربية، لك باشتراك واحد فقط، شاهدها الآن عبر تدرب بلا حدود وأحصل على شهادة إتمام للدورة التدريبية فور الانتهاء منها، مئات من الشهادات التعليمية." },
      { id: "q2", title: "ما طرق الدفع المتاحة؟", content: "بطاقات ائتمانية، مدى، و Apple Pay." },
    ],
  },
  {
    id: "cat-2",
    name: "ما هي أفضل خطة تدريبية لي؟",
    items: [
      { id: "q3", title: "كيف أسجّل في دورة؟", content: "اختر الدورة واضغط تسجيل." },
      { id: "q4", title: "هل الشهادات معتمدة؟", content: "نعم، حسب كل دورة ومزوّدها." },
    ],
  },
  {
    id: "cat-3",
    name: "ما هي أفضل خطة تدريبية لي؟",
    items: [
      { id: "q3", title: "كيف أسجّل في دورة؟", content: "اختر الدورة واضغط تسجيل." },
      { id: "q4", title: "هل الشهادات معتمدة؟", content: "نعم، حسب كل دورة ومزوّدها." },
    ],
  },
];

export default function Questions() {
  return (
    <div className="p-6">
        <div className="text-[32px] font-[800] text-right mr-4 mb-10.5">أكثر الأسئلة الشائعة</div>
      <CategoryAccordion categories={data} singleOpenPerCategory />
    </div>
  );
}
